#+TITLE: limma-voom tutorial
#+AUTHOR: Jack Kamm
#+PROPERTY: header-args:R :session :results output

* Add metadata

We'll add some manually constructed variables to the metadata table
=x$samples=.

#+begin_src R
  samplenames <- substring(colnames(x), 12, nchar(colnames(x)))
  samplenames
#+end_src

#+RESULTS:
: 
: [1] "10_6_5_11" "9_6_5_11"  "purep53"   "JMS8-2"    "JMS8-3"    "JMS8-4"   
: [7] "JMS8-5"    "JMS9-P7c"  "JMS9-P8c"

#+begin_src R :results value :colnames yes :rownames yes
  colnames(x) <- samplenames
  group <- as.factor(c("LP", "ML", "Basal", "Basal", "ML", "LP", 
                       "Basal", "ML", "LP"))
  x$samples$group <- group
  lane <- as.factor(rep(c("L004","L006","L008"), c(3,4,2)))
  x$samples$lane <- lane
  x$samples
#+end_src

#+RESULTS:
|           | files                    | group | lib.size | norm.factors | lane |
|-----------+--------------------------+-------+----------+--------------+------|
| 10_6_5_11 | GSM1545535_10_6_5_11.txt | LP    | 32863052 |            1 | L004 |
| 9_6_5_11  | GSM1545536_9_6_5_11.txt  | ML    | 35335491 |            1 | L004 |
| purep53   | GSM1545538_purep53.txt   | Basal | 57160817 |            1 | L004 |
| JMS8-2    | GSM1545539_JMS8-2.txt    | Basal | 51368625 |            1 | L006 |
| JMS8-3    | GSM1545540_JMS8-3.txt    | ML    | 75795034 |            1 | L006 |
| JMS8-4    | GSM1545541_JMS8-4.txt    | LP    | 60517657 |            1 | L006 |
| JMS8-5    | GSM1545542_JMS8-5.txt    | Basal | 55086324 |            1 | L006 |
| JMS9-P7c  | GSM1545544_JMS9-P7c.txt  | ML    | 21311068 |            1 | L008 |
| JMS9-P8c  | GSM1545545_JMS9-P8c.txt  | LP    | 19958838 |            1 | L008 |

* Add gene annotations

The vignette uses the =Mus.musculus= R package to add gene
annotations. Another good tool for this is the =biomaRt= package.

#+begin_src R
  geneid <- rownames(x)
  genes <- select(Mus.musculus, keys=geneid, columns=c("SYMBOL", "TXCHROM"), 
                  keytype="ENTREZID")
  head(genes)
#+end_src

#+RESULTS:
#+begin_example

'select()' returned 1:many mapping between keys and columns

   ENTREZID  SYMBOL TXCHROM
1    497097    Xkr4    chr1
2 100503874 Gm19938    <NA>
3 100038431 Gm10568    <NA>
4     19888     Rp1    chr1
5     20671   Sox17    chr1
6     27395  Mrpl15    chr1
#+end_example

Remove duplicated gene IDs (due to discrepancies in different databases)

#+begin_src R
  genes <- genes[!duplicated(genes$ENTREZID),]
  x$genes <- genes
#+end_src

#+RESULTS:

* Filter genes with low expression

=filterByExpr()= is an =edgeR= function for removing genes with low
expression, and low statistical power for our comparison(s) of
interest.

In this example, it filtered the gene set from 27,179 to 16,624.

#+begin_src R
  dim(x)
  keep.exprs <- filterByExpr(x, group=group)
  x <- x[keep.exprs,, keep.lib.sizes=FALSE]
  dim(x)
#+end_src

#+RESULTS:
: [1] 27179     9
: 
: [1] 16624     9

** Design matrix

We model the gene expression as depending on the =group= and =lane=.

#+begin_src R
  design <- model.matrix(~0+group+lane)
  colnames(design) <- gsub("group", "", colnames(design))
  design
#+end_src

#+RESULTS:
#+begin_example

  Basal LP ML laneL006 laneL008
1     0  1  0        0        0
2     0  0  1        0        0
3     1  0  0        0        0
4     1  0  0        1        0
5     0  0  1        1        0
6     0  1  0        1        0
7     1  0  0        1        0
8     0  0  1        0        1
9     0  1  0        0        1
attr(,"assign")
[1] 1 1 1 2 2
attr(,"contrasts")
attr(,"contrasts")$group
[1] "contr.treatment"

attr(,"contrasts")$lane
[1] "contr.treatment"
#+end_example

** Contrasts

We'll also be interested in asking specific subquestions, such as: "Is
group Basal significantly different than group LP on this gene"?

To address these sub-questions, we'll set up /contrasts/ for pairwise
comparisons.

#+begin_src R
  contr.matrix <- makeContrasts(
     BasalvsLP = Basal-LP, 
     BasalvsML = Basal - ML, 
     LPvsML = LP - ML, 
     levels = colnames(design))
  contr.matrix
#+end_src

#+RESULTS:
:           Contrasts
: Levels     BasalvsLP BasalvsML LPvsML
:   Basal            1         1      0
:   LP              -1         0      1
:   ML               0        -1     -1
:   laneL006         0         0      0
:   laneL008         0         0      0

* Get significant genes

#+begin_src R :results value :colnames yes :rownames yes
  dt <- decideTests(efit)
  summary(dt)
#+end_src

#+RESULTS:
|        | BasalvsLP | BasalvsML | LPvsML |
|--------+-----------+-----------+--------|
| Down   |      4648 |      4927 |   3135 |
| NotSig |      7113 |      7026 |  10972 |
| Up     |      4863 |      4671 |   2517 |

